In [1]:
import pandas as pd
import numpy as np

2.2.2
1.26.4

In [3]:
pd.__version__

'2.2.2'

In [5]:
n_rows = 5
n_cols = 2
cols = ['bil_pecahan', 'bil_bulat']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),
                 columns=cols)
df['bil_pecahan'] = df ['bil_pecahan'].astype('float')

df['bil_pecahan'] = df['bil_pecahan'].astype('float')

df

   bil_pecahan  bil_bulat
0          3.0          7
1          3.0         18
2          2.0         12
3          4.0          9
4          8.0          4

In [7]:
# df.index = pd.util.testing.makeDateIndex(n_rows, freq='H')
df.index = pd.date_range(start='2023-10-01', periods=n_rows, freq='h')

df = df.reset_index()

df['teks'] = list('ABCDE')

df

                index  bil_pecahan  bil_bulat teks
0 2023-10-01 00:00:00          3.0          7    A
1 2023-10-01 01:00:00          3.0         18    B
2 2023-10-01 02:00:00          2.0         12    C
3 2023-10-01 03:00:00          4.0          9    D
4 2023-10-01 04:00:00          8.0          4    E

In [9]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

In [11]:
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0          3.0          7
1          3.0         18
2          2.0         12
3          4.0          9
4          8.0          4

In [13]:
df.select_dtypes(include='float')

   bil_pecahan
0          3.0
1          3.0
2          2.0
3          4.0
4          8.0

In [15]:
df.select_dtypes(include='int')

   bil_bulat
0          7
1         18
2         12
3          9
4          4

In [17]:
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

In [19]:
df.select_dtypes(include='datetime')

                index
0 2023-10-01 00:00:00
1 2023-10-01 01:00:00
2 2023-10-01 02:00:00
3 2023-10-01 03:00:00
4 2023-10-01 04:00:00

In [21]:
df.select_dtypes(include=['number', 'object'])

   bil_pecahan  bil_bulat teks
0          3.0          7    A
1          3.0         18    B
2          2.0         12    C
3          4.0          9    D
4          8.0          4    E